In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data_dir = './data/Bengaluru_House_Data.csv'

In [3]:
df = pd.read_csv(data_dir)

df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [13]:
df.tail()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.0
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [12]:
df.shape

(13320, 9)

### Analysis of area_type

In [15]:
df['area_type'].unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [16]:
df.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

### Assumptions:

* area_type may not decide the price
* availability may not decide the price
* society may not decide the price

These columns can be dropped(mainly because they are text values and doesn't show correlation with the price)

In [19]:
df1 = df.drop(['area_type', 'availability', 'society'], axis='columns')

df1.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [20]:
df1.shape

(13320, 6)

### Data cleanup

#### 1. Reviewing all NA values

In [21]:
df1.isna()

       location   size  total_sqft   bath  balcony  price
0         False  False       False  False    False  False
1         False  False       False  False    False  False
2         False  False       False  False    False  False
3         False  False       False  False    False  False
4         False  False       False  False    False  False
...         ...    ...         ...    ...      ...    ...
13315     False  False       False  False    False  False
13316     False  False       False  False     True  False
13317     False  False       False  False    False  False
13318     False  False       False  False    False  False
13319     False  False       False  False    False  False

[13320 rows x 6 columns]

In [25]:
df1.isna().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

#### On seeing the numbers, since we have 13k records we can safely choose to drop the NA records.

* Alternatively, we can consider to fill the NA values with the median value of that column
* Filling NA values for column balcony with median value

In [31]:
df1.isna().sum()
df1[df1['balcony'].isna()]

                      location       size total_sqft  bath  balcony   price
6             Old Airport Road      4 BHK       2732   4.0      NaN  204.00
7                 Rajaji Nagar      4 BHK       3300   4.0      NaN  600.00
9                 Gandhi Bazar  6 Bedroom       1020   6.0      NaN  370.00
34               Kasturi Nagar      3 BHK       1925   3.0      NaN  125.00
40               Murugeshpalya      2 BHK       1296   2.0      NaN   81.00
...                        ...        ...        ...   ...      ...     ...
13277      Kundalahalli Colony  7 Bedroom       1400   7.0      NaN  218.00
13279  Vishwanatha Nagenahalli  6 Bedroom       1200   5.0      NaN  130.00
13306    Rajarajeshwari Nagara  4 Bedroom       1200   5.0      NaN  325.00
13309             Yeshwanthpur      3 BHK       1675   3.0      NaN   92.13
13316            Richards Town      4 BHK       3600   5.0      NaN  400.00

[609 rows x 6 columns]

In [36]:
df1['balcony'] = df1['balcony'].fillna(df1['balcony'].median())

df1.isna().sum()

location       1
size          16
total_sqft     0
bath          73
balcony        0
price          0
dtype: int64

In [37]:
df2 = df1.dropna()
df2.isna().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [38]:
df2.shape

(13246, 6)

#### 2. Cleaning up 'size' column

* The size column represents the number of bedrooms essentially. So we can extract the number value for all the records since there are multiple ways the same column has been described

* A new column can be created called bhk which stores the number of bedrooms as a numeric value

In [42]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [46]:
df2['bhk'] = df2['size'].apply(lambda bhk: int(bhk.split(' ')[0]))

df2.head()

C:\Users\Rajat\anaconda3\envs\coursework\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

                   location       size total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00    2

In [47]:
df2['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [48]:
df2[df2['bhk'] > 20]

,location,size,total_sqft,bath,balcony,price,bhk
1718,2Electronic City Phase II,27 BHK,8000,27.0,0.0,230.0,27
4684,Munnekollal,43 Bedroom,2400,40.0,0.0,660.0,43

#### From above result, it seems there is some kind of anamoly with total_sqft column for example a house with total_sqft of 2400 is not likely to have 43 bedrooms.

#### 3. Exploring the error in 'total_sqft' column

* There are some ranged values - which can be replaced with the mean of the range for total sqft.
* There are some non float values - which we can filter out as we want only numeric values.
* There are valid values but not in square ft for example in sq. meter / perch etc. - can be dropped (alternatively, they can be unit converted using functions)

In [50]:
df2['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [53]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [81]:
# All the records with a non-float value of total_sqft
df2[~df2['total_sqft'].apply(is_float)].head(10)

,location,size,total_sqft,bath,balcony,price,bhk
30,Yelahanka,4 BHK,2100 - 2850,4.0,0.0,186.000,4
122,Hebbal,4 BHK,3067 - 8156,4.0,0.0,477.000,4
137,8th Phase JP Nagar,2 BHK,1042 - 1105,2.0,0.0,54.005,2
165,Sarjapur,2 BHK,1145 - 1340,2.0,0.0,43.490,2
188,KR Puram,2 BHK,1015 - 1540,2.0,0.0,56.800,2
410,Kengeri,1 BHK,34.46Sq. Meter,1.0,0.0,18.500,1
549,Hennur Road,2 BHK,1195 - 1440,2.0,0.0,63.770,2
648,Arekere,9 Bedroom,4125Perch,9.0,2.0,265.000,9
661,Yelahanka,2 BHK,1120 - 1145,2.0,0.0,48.130,2
672,Bettahalsoor,4 Bedroom,3090 - 5002,4.0,0.0,445.000,4

In [82]:
def convert_to_float(x):
    if '-' in x:
        tokens = x.split('-')
        if len(tokens) == 2:
            # compute mean
            return np.mean([float(tokens[0]), float(tokens[1])])
    elif 'Sq. Meter' in x:
        tokens = x.split('Sq. Meter')
        return float(tokens[0]) * 10.7639
    elif 'Perch' in x:
        tokens = x.split('Perch')
        return float(tokens[0]) * 272.25
    try:
        # if single value then return as float
        return float(x)
    except:
        return None

In [83]:
# Deep copy the existing data frame
df3 = df2.copy()

# Update the total_sqft column with float values
df3['total_sqft'] = df2['total_sqft'].apply(convert_to_float)
df3.head(10)

                   location       size  total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0      1.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0      1.0   51.00    2
5                Whitefield      2 BHK      1170.0   2.0      1.0   38.00    2
6          Old Airport Road      4 BHK      2732.0   4.0      2.0  204.00    4
7              Rajaji Nagar      4 BHK      3300.0   4.0      2.0  600.00    4
8              Marathahalli      3 BHK      1310.0   3.0      1.0   63.25    3
9              Gandhi Bazar  6 Bedroom      1020.0   6.0      2.0  370.00    6

In [84]:
# Check some indices from above erroneous data frame wrt total_sqft
locs = [165, 410, 648]

for i in locs:
    print(df3.loc[i])
    print('-'*25)

location      Sarjapur
size             2 BHK
total_sqft      1242.5
bath                 2
balcony              0
price            43.49
bhk                  2
Name: 165, dtype: object
-------------------------
location      Kengeri
size            1 BHK
total_sqft    370.924
bath                1
balcony             0
price            18.5
bhk                 1
Name: 410, dtype: object
-------------------------
location          Arekere
size            9 Bedroom
total_sqft    1.12303e+06
bath                    9
balcony                 2
price                 265
bhk                     9
Name: 648, dtype: object
-------------------------

In [85]:
df3.isna().sum()

location       0
size           0
total_sqft    28
bath           0
balcony        0
price          0
bhk            0
dtype: int64

#### As there are still some records with NaN in total_sqft, and the number is very less we can drop them

In [91]:
df4 = df3.dropna()

In [92]:
df4.isna().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
bhk           0
dtype: int64

### Finally, df4 has been cleaned and is a proper dataset for further processing

In [94]:
df4.head()

                   location       size  total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0      1.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0      1.0   51.00    2

#### Save the cleaned up data frame as csv

In [95]:
df4.to_csv('./data/clean_data.csv')